bvweerd/geekmagic-tv-esp8266/src/display.cpp
#include "display.h"
#include "config.h"
#include "logger.h"
#include <LittleFS.h>
#include <TJpg_Decoder.h>
#include <ESP8266WiFi.h>
#include <vector>
#include <time.h> // For time and date functions

// Font size definitions for clarity
#define FONT_INFO 1      // Small font for IP addresses, etc.
#define FONT_MESSAGE 2   // Font for messages and labels
#define FONT_DEFAULT 4   // Default font size for various things
#define FONT_TIME 6      // Large font for the main clock time

TFT_eSPI tft = TFT_eSPI();
DisplayState displayState;
int scrollPos = 240;

bool tft_output(int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t* bitmap) {
    if (y >= tft.height()) return 0;
    tft.pushImage(x, y, w, h, bitmap);
    return 1;
}

// Helper function to wrap text
std::vector<String> wrapText(String text, int font, int maxWidth) {
    std::vector<String> lines;
    if (text.isEmpty()) {
        lines.push_back("");
        return lines;
    }

    // Set the font for text width calculations
    tft.setTextFont(font);

    String currentLine = "";
    String word = "";
    // Temporarily increase buffer size to handle longer lines during word accumulation
    currentLine.reserve(text.length() + 10);
        word.reserve(text.length() + 10);

        for (size_t i = 0; i < text.length(); i++) {
            char c = text.charAt(i);
            if (c == ' ') {            // Check if adding the word exceeds maxWidth
            if (tft.textWidth(currentLine + word) > maxWidth) { // Use textWidth with current font set
                // If current line is not empty, add it and start a new line with the word
                if (!currentLine.isEmpty()) {
                    lines.push_back(currentLine);
                    currentLine = word; // Start new line with the current word
                } else {
                    // Word itself is longer than maxWidth, force break within word if needed
                    // For simplicity, for now just add the too-long word on its own line
                    lines.push_back(word);
                    currentLine = "";
                }
            } else {
                currentLine += word;
            }
            currentLine += " "; // Add space after word
            word = "";
        } else {
            word += c;
        }
    }

    // Add the last word/part of word
    if (!word.isEmpty()) {
        if (tft.textWidth(currentLine + word) > maxWidth) { // Use textWidth with current font set
            if (!currentLine.isEmpty()) {
                lines.push_back(currentLine);
            }
            lines.push_back(word);
        } else {
            currentLine += word;
        }
    }

    // Add the last line if not empty
    if (!currentLine.isEmpty()) {
        lines.push_back(currentLine);
    }

    return lines;
}

void getFormattedDate(char* buffer, size_t bufferSize) {
    time_t now;
    struct tm timeinfo;
    time(&now);
    localtime_r(&now, &timeinfo);

    // DD-MM-YYYY\0
    strftime(buffer, bufferSize, "%d-%m-%Y", &timeinfo);
    buffer[bufferSize - 1] = '\0'; // Ensure null-termination
}

void displayInit() {
    logPrint(F("Display init..."));

    tft.init();
    tft.setRotation(0);
    tft.invertDisplay(true);  // Match ESPHome invert_colors: true

    logPrint(F("Display initialized, testing colors..."));

    // Test: fill screen with colors
    tft.fillScreen(TFT_RED);
    delay(500);
    tft.fillScreen(TFT_GREEN);
    delay(500);
    tft.fillScreen(TFT_BLUE);
    delay(500);
    tft.fillScreen(TFT_WHITE);
    delay(500);
    tft.fillScreen(TFT_BLACK);

    // Test text
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setTextDatum(MC_DATUM);
    tft.drawString("INIT", 120, 120, FONT_DEFAULT);

    TJpgDec.setJpgScale(1);
    TJpgDec.setSwapBytes(true);
    TJpgDec.setCallback(tft_output);

    strncpy(displayState.line1, "00:00", sizeof(displayState.line1));
    displayState.line2[0] = '\0'; // Initialize custom message line as empty
    displayState.ipInfo[0] = '\0'; // Initialize IP info as empty
    displayState.showImage = false;
    displayState.imagePath[0] = '\0'; // Initialize image path as empty
    displayState.apMode = false;
    displayState.apSSID[0] = '\0';
    displayState.apPassword[0] = '\0';

    // Backlight on (inverted PWM: low value = bright)
    pinMode(PIN_BACKLIGHT, OUTPUT);
    analogWriteFreq(1000);            // Zet PWM frequency
    analogWriteRange(1023);           // 10bit

    // Test: first full brightness
    logPrint(F("Testing backlight..."));
    analogWrite(PIN_BACKLIGHT, 0);    // Inverted: 0 = full bright
    delay(500);

    logPrint(F("Display init complete"));
}

void displaySetBrightness(int brightness) {
    brightness = constrain(brightness, 0, 100);

    // ESP8266 PWM range is 0-1023
    // Hardware is inverted: LOW = bright, HIGH = off
    int pwmValue;

    if (brightness == 0) {
        pwmValue = 1023;  // Off
    } else if (brightness == 100) {
        pwmValue = 0;     // Full bright
    } else {
        // Map 1-99 to 1023-0 (inverted)
        pwmValue = map(brightness, 0, 100, 1023, 0);
    }

    analogWrite(PIN_BACKLIGHT, pwmValue);
    logPrintf("Brightness: %d%%, PWM: %d", brightness, pwmValue);
}

int getWiFiSignalPercent() {
    long rssi = WiFi.RSSI();
    if (rssi <= -100) return 0;
    if (rssi >= -50) return 100;
    return 2 * (rssi + 100);
}

void displayUpdate() {
    logPrint(F("displayUpdate() called"));

    // Track last mode to reset state on mode change (eliminate flickering)
    static uint8_t lastMode = 0; // 0=clock, 1=ap, 2=image
    uint8_t currentMode = (displayState.showImage && displayState.imagePath[0] != '\0') ? 2 : (displayState.apMode ? 1 : 0);

    // On mode change, force full redraw
    if (currentMode != lastMode) {
        tft.fillScreen(TFT_BLACK);
        lastMode = currentMode;
    }

    if (displayState.showImage && displayState.imagePath[0] != '\0') {
        logPrint(String(F("Rendering image: ")) + displayState.imagePath);
        displayRenderImage((const char*)displayState.imagePath);
    } else if (displayState.apMode) {
        logPrint(F("Rendering AP mode screen"));
        displayRenderAPMode();
    } else {
        logPrint(F("Rendering clock"));
        displayRenderClock();
    }
    logPrint(F("displayUpdate() done"));
}

