bvweerd/geekmagic-tv-esp8266/src/display.cpp
        if (messageChanged || !prevState.initialized || layoutChanged) {
            // Direct TFT draw for messages with batched SPI
            tft.startWrite();
            tft.fillRect(0, currentY, tft.width(), messageWrappedLines.size() * messageLineHeight + 10, TFT_BLACK);
            for (size_t i = 0; i < messageWrappedLines.size(); i++) {
                tft.drawString(messageWrappedLines[i], tft.width() / 2, currentY + (i * messageLineHeight), messageFont);
            }
            tft.endWrite();
            strncpy(prevState.line2, displayState.line2, sizeof(prevState.line2) - 1);
            prevState.line2[sizeof(prevState.line2) - 1] = '\0'; // Ensure null termination
        }
    } else if (prevState.line2[0] != '\0') {
        // Message was cleared - erase previous message
        int messageFont = FONT_MESSAGE;
        tft.setTextFont(messageFont);
        int messageLineHeight = tft.fontHeight();
        currentY += messageLineHeight / 2;
        tft.startWrite();
        tft.fillRect(0, currentY, tft.width(), messageLineHeight * 3, TFT_BLACK);
        tft.endWrite();
        prevState.line2[0] = '\0';
    }

    logPrint(F("displayRenderClock DONE (Simplified)"));
}

void displayRenderAPMode() {
    logPrint(F("displayRenderAPMode START"));

    // Only clear screen on mode change
    static bool apModeRendered = false;
    if (!apModeRendered) {
        tft.fillScreen(TFT_BLACK);
        apModeRendered = true;
    }

    int currentY = 5; // Start from top with small margin

    // Display IP Info at the top (small font)
    if (displayState.ipInfo[0] != '\0') {
        tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
        tft.setTextDatum(TC_DATUM);
        int ipFont = FONT_INFO; // Small font
        tft.setTextFont(ipFont);
        int ipLineHeight = tft.fontHeight();
        std::vector<String> ipWrappedLines = wrapText(String(displayState.ipInfo), ipFont, tft.width() - 10);

        for (size_t i = 0; i < ipWrappedLines.size(); i++) {
            tft.drawString(ipWrappedLines[i], tft.width() / 2, currentY + (i * ipLineHeight), ipFont);
        }
        currentY += ipWrappedLines.size() * ipLineHeight + 20; // Add spacing after IP
    }

    // Calculate remaining vertical space
    int remainingHeight = tft.height() - currentY;

    // Display "AP Mode" header
    tft.setTextColor(TFT_CYAN, TFT_BLACK);
    tft.setTextDatum(TC_DATUM);
    int headerFont = FONT_DEFAULT;
    tft.setTextFont(headerFont);
    int headerHeight = tft.fontHeight();

    // Display SSID label and value
    int labelFont = FONT_MESSAGE;
    int valueFont = FONT_DEFAULT;
    tft.setTextFont(labelFont);
    int labelHeight = tft.fontHeight();
    tft.setTextFont(valueFont);
    int valueHeight = tft.fontHeight();

    // Calculate total content height
    int totalContentHeight = headerHeight + 10 + // "AP Mode" + spacing
                            labelHeight + valueHeight + 10 + // SSID section + spacing
                            labelHeight + valueHeight;        // Password section

    // Center content vertically in remaining space
    int contentStartY = currentY + (remainingHeight - totalContentHeight) / 2;

    // Draw "AP Mode" header
    tft.setTextFont(headerFont);
    tft.setTextColor(TFT_CYAN, TFT_BLACK);
    tft.drawString("AP Mode", tft.width() / 2, contentStartY, headerFont);
    contentStartY += headerHeight + 10;

    // Draw SSID label
    tft.setTextFont(labelFont);
    tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
    tft.drawString("SSID:", tft.width() / 2, contentStartY, labelFont);
    contentStartY += labelHeight;

    // Draw SSID value
    tft.setTextFont(valueFont);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    std::vector<String> ssidWrappedLines = wrapText(String(displayState.apSSID), valueFont, tft.width() - 20); // -20 for margins
    int ssidLineY = contentStartY;
    for (size_t i = 0; i < ssidWrappedLines.size(); i++) {
        tft.drawString(ssidWrappedLines[i], tft.width() / 2, ssidLineY + (i * valueHeight), valueFont);
    }
    contentStartY += ssidWrappedLines.size() * valueHeight + 10;

    // Draw Password label
    tft.setTextFont(labelFont);
    tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
    tft.drawString("Password:", tft.width() / 2, contentStartY, labelFont);
    contentStartY += labelHeight;

    // Draw Password value
    tft.setTextFont(valueFont);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    std::vector<String> passwordWrappedLines = wrapText(String(displayState.apPassword), valueFont, tft.width() - 20); // -20 for margins
    int passwordLineY = contentStartY;
    for (size_t i = 0; i < passwordWrappedLines.size(); i++) {
        tft.drawString(passwordWrappedLines[i], tft.width() / 2, passwordLineY + (i * valueHeight), valueFont);
    }

    logPrint(F("displayRenderAPMode DONE"));
}

void displayBlankScreen() {
    tft.fillScreen(TFT_BLACK);
    logPrint(F("Display blanked to black."));
}

void displayRenderImage(const char *path) {
    if (!LittleFS.exists(path)) {
        displayShowMessage(F("Image not found"));
        return;
    }

    File jpgFile = LittleFS.open(path, "r");
    if (!jpgFile) {
        String errorMsg = String(F("Failed to open image file: ")) + path;
        displayShowMessage(errorMsg);
        logPrint(errorMsg);
        return;
    }
    logPrint(String(F("INFO: Image file opened: ")) + path);

    // Direct image swap without clearing screen for smooth transitions
    // The new JPEG will overwrite the previous image directly
    // Keep CS low during entire transfer to reduce overhead and speed up rendering
    tft.startWrite();
    JRESULT res = TJpgDec.drawFsJpg(0, 0, jpgFile);
    tft.endWrite();
    if (res != JDR_OK) {
        String errorMsg = String(F("JPEG Decode Failed\nCode: ")) + String(res);
        displayShowMessage(errorMsg);
        logPrint(errorMsg);
    }

    jpgFile.close(); // Close the file after decoding attempt
}

void displayShowMessage(const String &msg) {
    tft.fillScreen(TFT_BLACK); // Re-added for previous behavior
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setTextDatum(MC_DATUM);

    int startY = tft.height() / 2; // Starting Y position, will be adjusted
    int font = FONT_DEFAULT;

    // Calculate line height based on the font
    tft.setTextFont(font); // Set font for height calculation
    int lineHeight = tft.fontHeight();

