bvweerd/geekmagic-tv-esp8266/src/display.cpp
    // Split message by newline characters first
    std::vector<String> linesToProcess;
    int prev = 0;
    for (size_t i = 0; i < msg.length(); i++) {
        if (msg.charAt(i) == '\n') {
            linesToProcess.push_back(msg.substring(prev, i));
            prev = i + 1;
        }
    }
    linesToProcess.push_back(msg.substring(prev)); // Add the last part

    std::vector<String> finalWrappedLines;
    for (size_t i = 0; i < linesToProcess.size(); i++) {
        std::vector<String> wrapped = wrapText(linesToProcess[i], font, tft.width());
        finalWrappedLines.insert(finalWrappedLines.end(), wrapped.begin(), wrapped.end());
    }

    // Adjust startY to vertically center the block of text
    startY -= (finalWrappedLines.size() * lineHeight) / 2;

    // Draw each wrapped line
    for (size_t i = 0; i < finalWrappedLines.size(); i++) {
        tft.drawString(finalWrappedLines[i], tft.width() / 2, startY + (i * lineHeight), font);
    }
}

void displayShowAPScreen(const char* ssid, const char* password, const char* ip) {
    logPrint(F("Switching to AP screen"));
    displayState.apMode = true;
    displayState.showImage = false; // Ensure we're not trying to show an image
    strncpy(displayState.apSSID, ssid, sizeof(displayState.apSSID));
    displayState.apSSID[sizeof(displayState.apSSID) - 1] = '\0'; // Ensure null-termination
    strncpy(displayState.apPassword, password, sizeof(displayState.apPassword));
    displayState.apPassword[sizeof(displayState.apPassword) - 1] = '\0'; // Ensure null-termination
    strncpy(displayState.ipInfo, ip, sizeof(displayState.ipInfo));
    displayState.ipInfo[sizeof(displayState.ipInfo) - 1] = '\0'; // Ensure null-termination
    displayUpdate();
}

void displayCycleNextPage() {
    // Don't cycle pages if in AP mode
    if (displayState.apMode) {
        logPrint(F("Page cycling disabled in AP mode"));
        return;
    }

    // Cycle: Clock -> Image (if available) -> Clock
    if (!displayState.showImage) {
        // Currently showing clock, try to switch to image if available
        if (displayState.imagePath[0] != '\0' && LittleFS.exists(displayState.imagePath)) {
            logPrint(F("Cycling to image page"));
            displayState.showImage = true;
        } else {
            logPrint(F("No image available, staying on clock page"));
        }
    } else {
        // Currently showing image, switch back to clock
        logPrint(F("Cycling to clock page"));
        displayState.showImage = false;
    }

    // Immediately update the display
    displayUpdate();
}

// Track backlight state for toggle functionality
static int savedBrightness = 100;
static bool backlightOn = true;

void displayToggleBacklight() {
    if (backlightOn) {
        // Turn off backlight
        logPrint(F("Backlight OFF"));
        savedBrightness = 100; // Assume current brightness is 100 (could be read from settings)
        displaySetBrightness(0);
        backlightOn = false;
    } else {
        // Turn on backlight
        logPrintf("Backlight ON (brightness: %d)", savedBrightness);
        displaySetBrightness(savedBrightness);
        backlightOn = true;
    }
}
